
//В файле accumulator-1.js создай массив с десятью элементами числового типа.
//Создай переменную accumulator и собери в ней сумму всех элементов массива.
const array = [10, 12, 231, 1, 32, 6, 7, 8, 9, 9]
let accumulator = 0
for (i=0; i<array.length; i++){
    accumulator += array[i]
}
console.log(accumulator)



// Задача 3.3
// В файле accumulator-3.js создай массив с десятью элементами строкового типа. Перечисли в них известные тебе названия языков программирования.

// Создай переменную accumulator и собери в ней только те названия, которые длиннее трёх символов. (accumulator будет массивом, вспомни про .push())

// Задача 3.4
// В файле accumulator-4.js создай массив с десятью элементами строкового типа. Перечисли в них имена (без фамилий) своих одногруппников и преподавателей.

// Создай переменную accumulator и собери в ней все имена, которые начинаются на букву "а".

// Задача 3.5
// В файле accumulator-5.js создай массив с десятью элементами числового типа.

// Создай переменную accumulatorEven и собери в ней четные числа массива.

// Задача 3.6
// В файле accumulator-6.js создай массив с десятью элементами числового типа.

// Создай переменную accumulatorOdd и собери в ней нечетные числа массива.